sea-shell-soap-wiremock/src/main/resources/SeaShellsWSDLPersons.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://org.jesperancinha.shells/SeaShellsWSDLPersons/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="SeaShellsWSDLPersons" targetNamespace="http://org.jesperancinha.shells/SeaShellsWSDLPersons/">
  <wsdl:types>
    <xsd:schema targetNamespace="http://org.jesperancinha.shells/SeaShellsWSDLPersons/">
      <xsd:element name="persons">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="personId" type="xsd:int"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
      <xsd:element name="personsResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="out" type="xsd:string"/>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="personsRequest">
    <wsdl:part element="tns:persons" name="parameters"/>
  </wsdl:message>
  <wsdl:message name="personsResponse">
    <wsdl:part element="tns:personsResponse" name="parameters"/>
  </wsdl:message>
  <wsdl:portType name="SeaShellsWSDLPersons">
    <wsdl:operation name="persons">
      <wsdl:input message="tns:personsRequest"/>
      <wsdl:output message="tns:personsResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="SeaShellsWSDLPersonsSOAP" type="tns:SeaShellsWSDLPersons">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="persons">
      <soap:operation soapAction="http://org.jesperancinha.shells/SeaShellsWSDLPersons/persons"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="SeaShellsWSDLPersons">
    <wsdl:port binding="tns:SeaShellsWSDLPersonsSOAP" name="SeaShellsWSDLPersonsSOAP">
      <soap:address location="http://localhost:8080/seashells/persons"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
