sea-shell-soap-wiremock/sea-shell-soap-service/src/main/resources/mock/requests/persons/person2.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:persons xmlns:ns2="http://org.jesperancinha.shells/SeaShellsWSDLPersons/">
            <personId>2</personId>
        </ns2:persons>
    </S:Body>
</S:Envelope>